
list = ["지드래곤","황가람","제니","에스파","리쿠",
        "지드래곤","지드래곤","지드래곤","황가람","황가람",
        "지드래곤","지드래곤","지드래곤","황가람","황가람",
        "제니","제니","제니","제니","제니","제니","제니","제니",
        "에스파","리쿠","에스파","리쿠","에스파","리쿠","에스파","리쿠",
        "리쿠","리쿠","리쿠","리쿠","리쿠","리쿠"
        ]

singer = {}
# 각각의 가수가 몇 번 입력되어 있는지 출력

for l in list:
    if l not in singer:
        singer[l] = 1
    else:
        singer[l] += 1
        
for k,v in singer.items():       # 키, 값 출력
    print(f"{k} : {v}")        



# list = [1,2,3,1,2,3,5,6,8,9,10,1,2]
# # dic = {1:3,2:3,3:2,5:1,6:1,8:1,9:1,10:1}

# dic = {}

# for i in list:
#     if i not in dic:        # 키가 존재하는지 확인
#         dic[i] = ""
#     # dic[i] = dic[i] + 1     # 키가 몇 개 존재하는지 개수 파악
#     dic[i] += "■"
    
# print(dic)       
      
      
# for i,d in enumerate(dic):
#     print(f"{i} : {dic[d]}")    