# 로또 프로그램
 
import random
# 6개 숫자 랜덤 번호 생성
# 6개 입력 번호 생성
# 당첨번호 확인
# 출력


# 숫자맞추기 프로그램
import random
# 1차원 리스트 1~25 숫자 생성
# 랜덤으로 섞기
# 2차원 리스트에 1차원 리스트 값을 넣기
# 번호 입력
# 입력된 번호의 자리에 X 표시



# 성적처리 프로그램
# 초기 데이터 생성 - 리스트 안의 딕셔너리 데이터 [{},{}]
# 출력화면
# 1. 성적 입력
    # - 학생번호 자동생성
    # - 성적입력 반복 실행
    # - 이전화면 이동 구현
    # - 입력된 점수 체크: 숫자? 1~100?
# 2. 성적 출력
    # - 상단 타이틀 출력
    # - 각 학생 별 성적 출력
# 3. 성적 수정
    # - 수정하고자 하는 학생 검색
    # - 수정하려는 과목 선택
    # - 검색이 되지 않았을 경우 구현
# 4. 성적 정렬
    # - 이름으로 순차 정렬
    # - 합계로 순차 정렬
# 5. 성적 검색
    # - 학생 검색 후 있으면 출력
# 6. 등수처리
    # - 합계를 기준으로 등수처리 
# 0. 종료